In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha
1 -0.692047 -1.942032  X   beta
2  0.277905  1.776016  Y  alpha
3 -1.751883 -0.775141  Y   beta
4  0.026687  1.024487  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -0.238765
Y   -0.736989
Z    0.026687
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha
1 -0.692047 -1.942032  X   beta
2  0.277905  1.776016  Y  alpha
3 -1.751883 -0.775141  Y   beta
4  0.026687  1.024487  Z  alpha

In [9]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.692047
    JAN    0.277905
NY  FEB   -1.751883
    JAN    0.120602
Name: dataset1, dtype: float64

In [10]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.214518 -1.195515
   beta  -0.692047 -1.942032
Y  alpha  0.277905  1.776016
   beta  -1.751883 -0.775141
Z  alpha  0.026687  1.024487

In [11]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [12]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -1.195515
   beta  -1.942032
Y  alpha  1.776016
   beta  -0.775141
Z  alpha  1.024487

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [23]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha
1 -0.692047 -1.942032  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  0.277905  1.776016  Y  alpha
3 -1.751883 -0.775141  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.026687  1.024487  Z  alpha

In [25]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1={} Key2={}'.format(k1,k2))
    print(group)
    print('\n')

Key1=X Key2=alpha
   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha


Key1=X Key2=beta
   dataset1  dataset2 k1    k2
1 -0.692047 -1.942032  X  beta


Key1=Y Key2=alpha
   dataset1  dataset2 k1     k2
2  0.277905  1.776016  Y  alpha


Key1=Y Key2=beta
   dataset1  dataset2 k1    k2
3 -1.751883 -0.775141  Y  beta


Key1=Z Key2=alpha
   dataset1  dataset2 k1     k2
4  0.026687  1.024487  Z  alpha

In [26]:
gr = dframe.groupby('k1')

In [27]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha
1 -0.692047 -1.942032  X   beta

In [28]:
group_dict = dict(list(dframe.groupby('k1')))

In [30]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.214518 -1.195515  X  alpha
1 -0.692047 -1.942032  X   beta

In [31]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [32]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.214518 -1.195515
 1 -0.692047 -1.942032
 2  0.277905  1.776016
 3 -1.751883 -0.775141
 4  0.026687  1.024487, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}